src/cf/InformationRegisters/уатНормыРасходаГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатНормыРасходаГСМ</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛинейнаяНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаЕздку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаЗапуск</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаИзменениеСобственногоВеса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаОперацию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаОтопитель</Name>
					<Comment>Норма на отопитель, кондиционер, климат-контроль</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПростойСВклДвигателем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПростойСВклДвигателемЛитры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПростойСВклДвигателемПроцентомОтБазовой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота4</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота5</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота6</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота7</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота8</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота9</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпециальнаяРабота10</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу7</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу8</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу9</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаСпециальнуюРаботу10</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаТранспортнуюРаботу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаСпециальнаяНаМоточас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СезоннаяНадбавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НадбавкаНаКондиционер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьПростоиДляРасчетаНормыМоточасов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АлгоритмРасчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаБулиты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаНаПредПЖД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГСМ</Name>
					<Comment>ГСМ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МодельТС</Name>
					<Comment>Модель ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РаботаНаДвухВидахТопливаОдновременно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатНоменклатураГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатНоменклатураГСМ</Name>
			<Comment>Доп. сведения для ГСМ</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчетОстатковТЖ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаГСМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатГруппыГСМ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГСМТалона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛитровыйТалон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоминалТалона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Плотность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатГруппыГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатГруппыГСМ</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПрисадкиИТехническиеЖидкости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Талон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Топливо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМасло</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Электроэнергия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатВидыМоделейТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыМоделейТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автотранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прицеп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвиационныйТранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МорскойТранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖДТранспорт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/уатНормыРасходаГСМ/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	уатЗащищенныеФункцииСервер.уатРегистрФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка,ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	Если ТолькоПросмотр Тогда
		Элементы.ГруппаПростои.ТолькоПросмотр = Истина;
		Элементы.ГруппаФормула.ТолькоПросмотр = Истина;
		//Элементы.РедактироватьФормулу.Доступность = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоПросмотрМодели") И Параметры.ТолькоПросмотрМодели Тогда
		Элементы.МодельТС.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Не ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.уатНормыРасходаГСМ) Тогда 
		Элементы.ВидНормыНаПростой.Доступность = Ложь;
	КонецЕсли;
	
	// Элементы.ГСМ.СписокВыбора.Очистить();
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	уатНоменклатураГСМ.Номенклатура
	|ИЗ
	|	РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
	|ГДЕ
	|	уатНоменклатураГСМ.ГруппаГСМ = ЗНАЧЕНИЕ(Перечисление.уатГруппыГСМ.Топливо)");
	ВыборкаНом = Запрос.Выполнить().Выбрать();
	Пока ВыборкаНом.Следующий() Цикл
		Элементы.ГСМ.СписокВыбора.Добавить(ВыборкаНом.Номенклатура);
	КонецЦикла;
	
	// Если норма копируется - установим дату текущим числом
	Если НЕ Параметры.ЗначениеКопирования.Пустой() Тогда 
		Запись.Период = НачалоДня(ТекущаяДата());
	КонецЕсли;
	
	Если Запись.НормаНаПростойСВклДвигателемЛитры <> 0 Тогда
		ВидНормыНаПростой = 2;
	ИначеЕсли Запись.НормаНаПростойСВклДвигателемПроцентомОтБазовой <> 0 Тогда
		ВидНормыНаПростой = 1;
	КонецЕсли;
	
	// Чтение структуры формулы расчета
	Если Параметры.ЗначениеКопирования.Пустой() Тогда
		ОбъектЗапись = РеквизитФормыВЗначение("Запись");
		АлгоритмРасчета = ОбъектЗапись.АлгоритмРасчета.Получить();
	Иначе // Чтение хранилища значений из объекта копирования, в объекте его нет при копировании
		МенЗаписи = РегистрыСведений.уатНормыРасходаГСМ.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенЗаписи, Параметры.ЗначениеКопирования);
		АлгоритмРасчета = Неопределено;
		МенЗаписи.Прочитать();
		Если МенЗаписи.Выбран() Тогда
			АлгоритмРасчета = МенЗаписи.АлгоритмРасчета.Получить();
		КонецЕсли;
	КонецЕсли;
	
	РасчетПоФормуле = (АлгоритмРасчета <> Неопределено);
	
	ПереключательДваВидаТоплива = ?(Запись.РаботаНаДвухВидахТопливаОдновременно, "Одновременно", "Поочередно");
		
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтобразитьФормулуРасчета();
	УстановкаЕдиницИзмерения();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Запись.МодельТС) Тогда 
		Если ТипЗнч(Запись.МодельТС) = Тип("СправочникСсылка.уатТС") Тогда
			ОснТопливоПоМодели = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.МодельТС, "Модель"), "ОсновноеТопливо");
			ДопТопливоПоМодели = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.МодельТС, "Модель"), "ДополнительноеТопливо");
		Иначе
			ОснТопливоПоМодели = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.МодельТС, "ОсновноеТопливо");
			ДопТопливоПоМодели = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.МодельТС, "ДополнительноеТопливо");
		КонецЕсли;
		Если Запись.ГСМ <> ОснТопливоПоМодели И Запись.ГСМ <> ДопТопливоПоМодели Тогда 
			ТекстСообщения = НСтр("en='Specified fuel does not correspond to bas. or extra fuel specified in vehicle model.';ru='Указанное топливо не соответствует осн. или доп. топливу, указанному в модели ТС.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Запись.ГСМ",,Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.РаботаНаДвухВидахТопливаОдновременно
		И НЕ ЕстьПоочереднаяНорма(ТекущийОбъект.МодельТС, ТекущийОбъект.ГСМ, ТекущийОбъект.Организация,
		Запись.ИсходныйКлючЗаписи) Тогда
		
		ТекстСообщения = "Перед вводом нормы для одновременной работы на двух видах топлива следует сначала ввести норму для поочередной работы.";
		уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстСообщения, Отказ,, СтатусСообщения.Внимание);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		Если ТипЗнч(АлгоритмРасчета) = Тип("Структура") Тогда
			ТекущийОбъект.АлгоритмРасчета = Новый ХранилищеЗначения(АлгоритмРасчета);
		Иначе
			ТекущийОбъект.АлгоритмРасчета = Неопределено;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГСМНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекОрганизация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяОрганизация");
	ДополнительныеПараметры	 = Новый Структура("ЗначениеГСМДоИзменения", Запись.ГСМ);
	ОписаниеОповещенияЗакр	 = Новый ОписаниеОповещения("ОписаниеОповещенияВыбораГСМ", ЭтотОбъект, ДополнительныеПараметры);
	
	ГруппыГСМ = Новый Массив;
	ГруппыГСМ.Добавить(ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Топливо"));
	ГруппыГСМ.Добавить(ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Электроэнергия"));
	уатЗащищенныеФункцииКлиент.СписокГСМдляТС(ТекОрганизация, Запись.МодельТС,
		ГруппыГСМ,,,ОписаниеОповещенияЗакр);
КонецПроцедуры

// Подключаемый динамически обработчик выбора топлива с отбором.
&НаКлиенте
Процедура ОписаниеОповещенияВыбораГСМ(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатЗакрытия) И РезультатЗакрытия <> ДополнительныеПараметры.ЗначениеГСМДоИзменения Тогда
		Запись.ГСМ = РезультатЗакрытия;
		Модифицированность = Истина;
		УстановитьВидимостьДоступностьНаСервере();
		УстановкаЕдиницИзмерения();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГСМПриИзменении(Элемент)
	УстановитьВидимостьДоступностьНаСервере();
	УстановкаЕдиницИзмерения();
КонецПроцедуры

&НаКлиенте
Процедура ГСМАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	мсвГруппДляОтбора = Новый Массив;
	мсвГруппДляОтбора.Добавить(ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Топливо"));
	мсвГруппДляОтбора.Добавить(ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Электроэнергия"));
	ДопПараметры = Новый Структура("ТС", Запись.МодельТС);
	ДанныеВыбора = уатГСМ.ПолучитьСписокАвтоподбораПоляГСМ(Текст, мсвГруппДляОтбора, ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ГСМОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ПараметрыПолученияДанных.СтрокаПоиска = "";
КонецПроцедуры

&НаКлиенте
Процедура НормаНаПростойСВклДвигателемПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Запись.НормаНаПростойСВклДвигателем) Тогда
		Запись.НормаНаПростойСВклДвигателемПроцентомОтБазовой = 0;
		Запись.НормаНаПростойСВклДвигателемЛитры = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормаНаПростойСВклДвигателемПроцентомОтБазовойПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Запись.НормаНаПростойСВклДвигателемПроцентомОтБазовой) Тогда
		Запись.НормаНаПростойСВклДвигателем = 0;
		Запись.НормаНаПростойСВклДвигателемЛитры = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормаНаПростойСВклДвигателемЛитрыПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Запись.НормаНаПростойСВклДвигателемЛитры) Тогда
		Запись.НормаНаПростойСВклДвигателем = 0;
		Запись.НормаНаПростойСВклДвигателемПроцентомОтБазовой = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МодельТСПриИзменении(Элемент)
	МодельТСПриИзмененииСервер();
	УстановитьВидимостьДоступностьНаСервере();	
КонецПроцедуры

&НаСервере
Процедура МодельТСПриИзмененииСервер()

	Если ТипЗнч(Запись.МодельТС) = Тип("СправочникСсылка.уатМоделиТС") Тогда
		Запись.ГСМ = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.МодельТС, "ОсновноеТопливо");
	ИначеЕсли ТипЗнч(Запись.МодельТС) = Тип("СправочникСсылка.уатТС") Тогда
		Запись.ГСМ = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.МодельТС.Модель, "ОсновноеТопливо");
	КонецЕсли;
	Если Запись.МодельТС.ВидМоделиТС = Перечисления.уатВидыМоделейТС.Прицеп
		ИЛИ Запись.МодельТС.ВидМоделиТС = Перечисления.уатВидыМоделейТС.Оборудование Тогда
		Запись.РаботаНаДвухВидахТопливаОдновременно = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНормыНаПростойПриИзменении(Элемент)
	Запись.НормаНаПростойСВклДвигателем = 0;
	Запись.НормаНаПростойСВклДвигателемЛитры = 0;
	Запись.НормаНаПростойСВклДвигателемПроцентомОтБазовой = 0;
	УстановитьВидимостьДоступностьНаСервере();	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота1ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота2ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота3ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота4ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота5ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота6ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота7ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота8ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота9ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпециальнаяРабота10ПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетПоФормулеПриИзменении(Элемент)
	Если НЕ РасчетПоФормуле Тогда
		АлгоритмРасчета = Неопределено;
	КонецЕсли;
	
	ОтобразитьФормулуРасчета();
	УстановитьВидимостьДоступностьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьФормулуНажатие(Элемент)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МодельТС", Запись.МодельТС);
	ПараметрыФормы.Вставить("АлгоритмРасчета", АлгоритмРасчета);
	ОповещениеЗакрытие = Новый ОписаниеОповещения("РедактироватьФормулуЗакрытиеФормы", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.уатНормыРасходаГСМ.Форма.КонструкторФормул", ПараметрыФормы, ЭтаФорма,,,, ОповещениеЗакрытие, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьФормулуЗакрытиеФормы(Результат, ДопПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		АлгоритмРасчета = Результат;
		ОтобразитьФормулуРасчета();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РежимРаботыНаДвухВидахТопливаПриИзменении(Элемент)
	Запись.РаботаНаДвухВидахТопливаОдновременно = (ПереключательДваВидаТоплива = "Одновременно");
	Модифицированность = Истина;
	УстановитьВидимостьДоступностьНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоступностьНаСервере()
	
	Если ТипЗнч(Запись.МодельТС) = Тип("СправочникСсылка.уатМоделиТС") Тогда
		НаличиеСпидометра = Запись.МодельТС.НаличиеСпидометра;
		НаличиеТопливногоБака = Запись.МодельТС.НаличиеТопливногоБака;
		ВидМоделиТС = Запись.МодельТС.ВидМоделиТС;
	ИначеЕсли ТипЗнч(Запись.МодельТС) = Тип("СправочникСсылка.уатТС") Тогда
		НаличиеСпидометра = Запись.МодельТС.Модель.НаличиеСпидометра;
		НаличиеТопливногоБака = Запись.МодельТС.Модель.НаличиеТопливногоБака;
		ВидМоделиТС = Запись.МодельТС.Модель.ВидМоделиТС;
	Иначе
		НаличиеСпидометра = Истина;
		НаличиеТопливногоБака = Истина;
		ВидМоделиТС = Неопределено;
	КонецЕсли;
	
	Элементы.ГруппаЛинейнаяНорма.Видимость = НаличиеСпидометра;
	Элементы.ГруппаНормаНаИзменениеСобственногоВеса.Видимость = НаличиеСпидометра;
	Элементы.ГруппаНормаНаТранспортнуюРаботу.Видимость = НаличиеСпидометра;
	Элементы.ГруппаНормаСпециальнаяНаМоточас.Видимость = НЕ НаличиеСпидометра;
	
	Элементы.ВидНормыНаПростой.СписокВыбора.Очистить();
	Если НаличиеСпидометра Тогда
		Элементы.ВидНормыНаПростой.СписокВыбора.Добавить(0, НСтр("en='km/1 hour of downtime';ru='км/1 час простоя'"));
		Элементы.ВидНормыНаПростой.СписокВыбора.Добавить(1, НСтр("en='% of basic';ru='% от базовой'"));
		Элементы.ВидНормыНаПростой.СписокВыбора.Добавить(2, НСтр("en='l/1 hour of downtime';ru='л/1 час простоя'"));
	Иначе
		Элементы.ВидНормыНаПростой.СписокВыбора.Добавить(0, НСтр("en='l/1 hour of downtime';ru='л/1 час простоя'"));
		Элементы.ВидНормыНаПростой.СписокВыбора.Добавить(1, НСтр("en='% of spec. on moto hour';ru='% от спец. на моточас'"));
		Если ВидНормыНаПростой = 2 Тогда
			ВидНормыНаПростой = 0;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ВидНормыНаПростой = 0 Тогда
		Элементы.ГруппаСтраницыВидПростоя.ТекущаяСтраница = Элементы.ГруппаСтраницаПростойКм;
	ИначеЕсли ВидНормыНаПростой = 1 Тогда
		Элементы.ГруппаСтраницыВидПростоя.ТекущаяСтраница = Элементы.ГруппаСтраницаПростойПроцент;
	ИначеЕсли ВидНормыНаПростой = 2 Тогда
		Элементы.ГруппаСтраницыВидПростоя.ТекущаяСтраница = Элементы.ГруппаСтраницаПростойЛ;
	КонецЕсли;
	
	Для Сч = 1 По 10 Цикл 
		СпецРабота = Запись["СпециальнаяРабота" + Формат(Сч, "ЧГ=0")];
		Элементы["НормаНаСпециальнуюРаботу" + Формат(Сч, "ЧГ=0")].Заголовок = НСтр("en='Norm';ru='Норма'") + " " + Формат(Сч, "ЧГ=0") + ", " + ЕдиницаИзмеренияДляТоплива()// НСтр("en='l';ru='л'")
		+ ?(ЗначениеЗаполнено(СпецРабота), "/" + ?(СпецРабота.Временный, " ", " 100 ") + СпецРабота.ЕдиницаИзмерения, "");
	КонецЦикла;
	
	Элементы.РедактироватьФормулу.Доступность = НЕ ТолькоПросмотр И РасчетПоФормуле;
	
	Элементы.ДекорацияНетПоочереднойНормы.Видимость = Запись.РаботаНаДвухВидахТопливаОдновременно
		И НЕ ЕстьПоочереднаяНорма(Запись.МодельТС, Запись.ГСМ, Запись.Организация, Запись.ИсходныйКлючЗаписи);
		
	Элементы.ГруппаДваВидаТоплива.Доступность =
		НЕ (ВидМоделиТС = Перечисления.уатВидыМоделейТС.Прицеп
		ИЛИ ВидМоделиТС = Перечисления.уатВидыМоделейТС.Оборудование);
		
	УстановкаЕдиницИзмерения();
	
	Если ВидМоделиТС = Перечисления.уатВидыМоделейТС.Прицеп
		ИЛИ ВидМоделиТС = Перечисления.уатВидыМоделейТС.Оборудование Тогда
		Элементы.ГруппаПредупреждение.Видимость = Истина;
		
		Если НаличиеСпидометра Тогда
			Элементы.тПредупреждение.Заголовок = СтрШаблон("В Путевом листе при выборе %1 в табличной части ""Прицепы и оборудование"" или ""Задание"""
				+ " при расчете нормативного расхода ГСМ нормы %1 не учитываются. Наличие %1"
				+ " влияет на применение нормы на изменение собственного веса для основного ТС по Путевому листу.",
				?(ВидМоделиТС = Перечисления.уатВидыМоделейТС.Прицеп, "прицепа", "оборудования"));
		Иначе
			Элементы.тПредупреждение.Заголовок = СтрШаблон("В Путевом листе при выборе %1 в табличной части ""Прицепы и оборудование"" или ""Задание"""
				+ " при расчете нормативного расхода ГСМ учитывается норма специальная на моточас%2 Наличие %1"
				+ " влияет на применение нормы на изменение собственного веса для основного ТС по Путевому листу.",
				?(ВидМоделиТС = Перечисления.уатВидыМоделейТС.Прицеп, "прицепа", "оборудования"),
				?(НаличиеТопливногоБака, ".", " (на работу специального оборудования для основного ТС)."));
		КонецЕсли;
	Иначе
		Элементы.ГруппаПредупреждение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьФормулуРасчета()
	Если ТипЗнч(АлгоритмРасчета) <> Тип("Структура")
		ИЛИ НЕ АлгоритмРасчета.Свойство("ОбщаяФормула")
		ИЛИ НЕ ЗначениеЗаполнено(АлгоритмРасчета.ОбщаяФормула) Тогда
		Элементы.РедактироватьФормулу.Заголовок = Нстр("en = 'Formula not specified'; ru = 'Формула не указана'");
	Иначе
		Элементы.РедактироватьФормулу.Заголовок = АлгоритмРасчета.ОбщаяФормула;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьПоочереднаяНорма(МодельТС, ГСМ, Организация, ИсходныйКлючЗаписи)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	уатНормыРасходаГСМСрезПоследних.ЛинейнаяНорма КАК ЛинейнаяНорма
	|ИЗ
	|	РегистрСведений.уатНормыРасходаГСМ.СрезПоследних(
	|			,
	|			НЕ РаботаНаДвухВидахТопливаОдновременно
	|				И МодельТС = &МодельТС
	|				И ГСМ = &ГСМ
	|				И Организация = &Организация) КАК уатНормыРасходаГСМСрезПоследних");
	Запрос.УстановитьПараметр("МодельТС", МодельТС);
	Запрос.УстановитьПараметр("ГСМ", ГСМ);
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат Ложь; // нет записей с поочередной нормой
	ИначеЕсли ЗначениеЗаполнено(ИсходныйКлючЗаписи.Период)
		И НЕ ИсходныйКлючЗаписи.РаботаНаДвухВидахТопливаОдновременно Тогда
		Возврат Ложь; // запись с поочередной нормой есть, но это измененная текущая запись - считаем что нет
	Иначе
		Возврат Истина; // есть запись с поочередной нормой
	КонецЕсли;
КонецФункции

&НаСервере
Процедура УстановкаЕдиницИзмерения()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатНоменклатураГСМ.ГруппаГСМ КАК ГруппаГСМ
	|ИЗ
	|	РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
	|ГДЕ
	|	уатНоменклатураГСМ.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Запись.ГСМ);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если Не РезультатЗапроса.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Запись.МодельТС) = Тип("СправочникСсылка.уатМоделиТС") Тогда
		НаличиеСпидометра = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.МодельТС, "НаличиеСпидометра");
	ИначеЕсли ТипЗнч(Запись.МодельТС) = Тип("СправочникСсылка.уатТС") Тогда
		НаличиеСпидометра = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Запись.МодельТС, "Модель"), "НаличиеСпидометра");
	Иначе
		НаличиеСпидометра = Истина;
	КонецЕсли;
	
	ИндексВидаНормыНаПростой = ?(НаличиеСпидометра, 2, 0);
	
	Если РезультатЗапроса.ГруппаГСМ = Перечисления.уатГруппыГСМ.Электроэнергия Тогда
		Элементы.ДекорацияЛинейнаяНорма.Заголовок = НСтр("ru = 'Линейная норма, кВт/100 км'; en = 'Linear rate, kW/100 km'");
		Элементы.ЛинейнаяНорма.Подсказка = НСтр("ru = 'Линейная норма, кВт/100 км'; en = 'Linear rate, kW/100 km'");
		Элементы.ДекорацияНормаСпециальнаяНаМоточас.Заголовок = НСтр("ru = 'Норма спец. на моточас, кВт/ч'; en = 'Special standard per engine hour, kW/h'");
		Элементы.НормаСпециальнаяНаМоточас.Подсказка = НСтр("ru = 'Норма спец. на моточас, кВт/ч'; en = 'Special standard per engine hour, kW/h'");
		Элементы.ДекорацияНормаНаИзменениеСобственногоВеса.Заголовок = НСтр("ru = 'Норма на изм. собств. веса, кВт/100 т.км'; en = 'Standard for change of tare weight, kW/100 t.km'");
		Элементы.НормаНаИзменениеСобственногоВеса.Подсказка = НСтр("ru = 'Норма на изм. собств. веса, кВт/100 т.км'; en = 'Standard for change of tare weight, kW/100 t.km'");
		Элементы.ДекорацияНормаНаТранспортнуюРаботу.Заголовок = НСтр("ru = 'Норма на трансп. работу, кВт/100 т.км'; en = 'Standard for transport work, kW/100 t.km'");
		Элементы.НормаНаТранспортнуюРаботу.Подсказка = НСтр("ru = 'Норма на трансп. работу, кВт/100 т.км'; en = 'Standard for transport work, kW/100 t.km'");
		Элементы.ДекорацияЕздка.Заголовок = НСтр("ru = 'Норма на ездку, кВт'; en = 'Driving rate, kW'");
		Элементы.НормаНаЕздку.Подсказка = НСтр("ru = 'Норма на ездку, кВт'; en = 'Driving rate, kW'");
		Элементы.ДекорацияНормаНаОперацию.Заголовок = НСтр("ru = 'Норма на операцию, кВт'; en = 'Standard per operation, kW'");
		Элементы.НормаНаОперацию.Подсказка = НСтр("ru = 'Норма на операцию, кВт'; en = 'Standard per operation, kW'");
		Элементы.ДекорацияНормаНаЗапуск.Заголовок = НСтр("ru = 'Норма на запуск, кВт'; en = 'Starting power, kW'");
		Элементы.НормаНаЗапуск.Подсказка = НСтр("ru = 'Норма на запуск, кВт'; en = 'Starting power, kW'");
		Элементы.ДекорацияНормаНаОтопитель.Заголовок = НСтр("ru = 'Норма на отопитель, кондиционер, климат-контроль, кВт/ч'; en = 'Standard for heater, air conditioner, climate control, kW/h'");
		Элементы.НормаНаОтопитель.Подсказка = НСтр("ru = 'Норма на отопитель, кондиционер, климат-контроль, кВт/ч'; en = 'Standard for heater, air conditioner, climate control, kW/h'");
		Элементы.ВидНормыНаПростой.СписокВыбора[ИндексВидаНормыНаПростой].Представление = НСтр("ru = 'кВт/1 час простоя'; en = 'kW/1 hour of downtime'");
	Иначе
		Элементы.ДекорацияЛинейнаяНорма.Заголовок = НСтр("ru = 'Линейная норма, л/100 км'; en = 'Linear rate, l/100 km'");
		Элементы.ЛинейнаяНорма.Подсказка = НСтр("ru = 'Линейная норма, л/100 км'; en = 'Linear rate, l/100 km'");
		Элементы.ДекорацияНормаСпециальнаяНаМоточас.Заголовок = НСтр("ru = 'Норма спец. на моточас, л/ч'; en = 'Special standard per engine hour, l/h'");
		Элементы.НормаСпециальнаяНаМоточас.Подсказка = НСтр("ru = 'Норма спец. на моточас, л/ч'; en = 'Special standard per engine hour, l/h'");
		Элементы.ДекорацияНормаНаИзменениеСобственногоВеса.Заголовок = НСтр("ru = 'Норма на изм. собств. веса, л/100 т.км'; en = 'Standard for change of tare weight, l/100 t.km'");
		Элементы.НормаНаИзменениеСобственногоВеса.Подсказка = НСтр("ru = 'Норма на изм. собств. веса, л/100 т.км'; en = 'Standard for change of tare weight, l/100 t.km'");
		Элементы.ДекорацияНормаНаТранспортнуюРаботу.Заголовок = НСтр("ru = 'Норма на трансп. работу, л/100 т.км'; en = 'Standard for transport work, l/100 t.km'");
		Элементы.НормаНаТранспортнуюРаботу.Подсказка = НСтр("ru = 'Норма на трансп. работу, л/100 т.км'; en = 'Standard for transport work, l/100 t.km'");
		Элементы.ДекорацияЕздка.Заголовок = НСтр("ru = 'Норма на ездку, л'; en = 'Driving norm, l'");
		Элементы.НормаНаЕздку.Подсказка = НСтр("ru = 'Норма на ездку, л'; en = 'Driving norm, l'");
		Элементы.ДекорацияНормаНаОперацию.Заголовок = НСтр("ru = 'Норма на операцию, л'; en = 'Norm per operation, l'");
		Элементы.НормаНаОперацию.Подсказка = НСтр("ru = 'Норма на операцию, л'; en = 'Norm per operation, l'");
		Элементы.ДекорацияНормаНаЗапуск.Заголовок = НСтр("ru = 'Норма на запуск, л'; en = 'Starting norm, l'");
		Элементы.НормаНаЗапуск.Подсказка = НСтр("ru = 'Норма на запуск, л'; en = 'Starting norm, l'");
		Элементы.ДекорацияНормаНаОтопитель.Заголовок = НСтр("ru = 'Норма на отопитель, кондиционер, климат-контроль, л/ч'; en = 'Standard for heater, air conditioner, climate control, l/h'");
		Элементы.НормаНаОтопитель.Подсказка = НСтр("ru = 'Норма на отопитель, кондиционер, климат-контроль, л/ч'; en = 'Standard for heater, air conditioner, climate control, l/h'");
		Элементы.ВидНормыНаПростой.СписокВыбора[ИндексВидаНормыНаПростой].Представление = НСтр("ru = 'л/1 час простоя'; en = 'l/1 hour of downtime'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕдиницаИзмеренияДляТоплива()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уатНоменклатураГСМ.ГруппаГСМ КАК ГруппаГСМ
	|ИЗ
	|	РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
	|ГДЕ
	|	уатНоменклатураГСМ.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Запись.ГСМ);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если Не РезультатЗапроса.Следующий() Тогда
		Возврат НСтр("en='l';ru='л'");
	КонецЕсли;
	
	Если РезультатЗапроса.ГруппаГСМ = Перечисления.уатГруппыГСМ.Электроэнергия Тогда
		Возврат НСтр("ru = 'кВт/ч'; en = 'kW/h'");
	Иначе
		Возврат НСтр("en='l';ru='л'");
	КонецЕсли;
КонецФункции

#КонецОбласти
